package yhc;

import java.util.Arrays;

import org.junit.Test;

public class MyTest {
	@Test
	public void test1(){
		String[] ids = {"纳金科技园","广州国际媒体港","南洋国际科技金融创新园","七喜创意创业园","富裕中心","东软广州研发与服务中心","凯华国际","广物中达广场","凤凰新村产业园","科学城七喜大厦","科汇金谷","科技城信息大厦西座9F","TCL文化产业园","益民科技园","航新科技大厦","光正科技产业园","中交广州航道局大楼A栋","融科商务园主楼","融科商务园副楼","琶洲商业广场","广州国际采购中心","环汇商业广场（南塔）","鱼珠创客EPARK","豪汇大厦","光正科技产业园","东软广州研发与服务中心","科学城七喜大厦","科汇金谷","益民科技园","广州国际媒体港","广州国际媒体港","琶洲商业广场","凯华国际","明美电子工业厂房","圣力科技园A栋","旗锐科技工业园","昊泰科技园","广州安博物流中心(一期)","广州安博物流中心（二期）","南科集成电子产业园","广运物流仓","励丰文化科技园","宏扬集团","保嘉乐器制造厂","圣力科技园B栋","光正科技产业园","豪汇大厦","纳金科技园","龙腾18 电子商务产业园","宏滔厂房","圣力科技园A栋","圣力科技园B栋","保嘉乐器制造厂","光正科技产业园","南科集成电子产业园","宏滔厂房","豪汇大厦","光正科技产业园","TCL文化产业园","益民科技园","凤凰新村产业园","七喜创意创业园","东软广州研发与服务中心","纳金科技园","圣力科技园","龙腾18 电子商务产业园","TCL文化产业园一栋","华夏汇海办公楼","华夏汇海厂房","鼎禾实业厂房","励丰文化科技","易翔科技园厂房","易翔科技园","易翔科技园写字楼","昊泰科技园","曼斯科技厂房","东港物流","吉赛机械科技厂房","莱迪节能产业园","鼎禾实业厂房园区","优信投服孵化器","1850创意园","姬堂地块","广州红砖厂创意园","广州景晟智能产业园","广州纳新孵化器园区","广州经济开发高新技术产业园区","广州开发区世联空间写字楼","广州开发区大型物流园"};
		Arrays.sort(ids);
		System.out.println(Arrays.toString(ids));
	}
}
